Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine Constructor
Overload List
Name | Description
GraphicPolyLine()
 Create a black line with width 1 and solid line type.
GraphicPolyLine(Color, Int32, GraphicPolyLine.LineType)
 Create a graphic polyline object with 0 points.
GraphicPolyLine(PolyLine, Color, Int32, GraphicPolyLine.LineType)
 Create a graphic polyline object.
Top
See Also
Reference
GraphicPolyLine Class
Tekla.Structures.Model.UI Namespace